def area(a, b): 
    '''
    Функция принимает два целых числа - длины сторон прямоугольника.

    a - длина одной стороны прямоугольника (float)
    b - длина второй стороны прямоугольника (float)

    Возвращает S - Площадь прямоугольника.

    Например при вызове area(4, 7), функция вернёт S = 28.
    '''
    return a * b 

def perimeter(a, b): 
    '''
    Функция принимает два целых числа - длины сторон прямоугольника.

    a - длина одной стороны прямоугольника (float)
    b - длина второй стороны прямоугольника (float)

    Возвращает P - Периметр прямоугольника.

    Например при вызове perimeter(4, 7), функция вернёт P = 22.
    '''
    return 2 * (a + b)