
def area(a):
    '''
    Функция принимает одно целое число - длину стороны квадрата.

    a - длина стороны квадрата (float)

    Возвращает S - Площадь квадрата.

    Например при вызове area(5), функция вернёт S = 25.
    '''
    return a * a


def perimeter(a):
    '''
    Функция принимает одно целое число - длину стороны квадрата.

    a - длина стороны квадрата (float)

    Возвращает P - Периметр квадрата.

    Например при вызове perimeter(5), функция вернёт P = 20.
    '''
    return 4 * a
