def area(a, h): 
    '''
    Функция принимает два целых числа - сторону треугольника и высоту, опущенную на нее.

    Возвращает S - Площадь треугольника.

    Например при вызове area(6, 4), функция вернёт S = 12.0.
    '''
    return a * h / 2 

def perimeter(a, b, c): 
    '''
    Функция принимает три целых числа - длины сторон треугольника:

    a - длина первой строны треугольника (float)
    b - длина второй стороны треугольника (float)
    c - длина третей стороны треугольника (float)

    Возвращает P - Периметр треугольника.

    Например при вызове perimeter(3, 4, 5), функция вернёт P = 12.
    '''
    return a + b + c 